Revit 2027 API
FabricationRodInfo.GetRodAttachedElementId Method
 Gets the identifier of the attached component for the specified rod.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId GetRodAttachedElementId(
	int rodIndex
)
Public Function GetRodAttachedElementId (
	rodIndex As Integer
) As LinkElementId
public:
LinkElementId^ GetRodAttachedElementId(
	int rodIndex
)
member GetRodAttachedElementId :
        rodIndex : int -> LinkElementId
Parameters
rodIndex Int32
 The index of the specified rod.
Return Value
LinkElementId
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The rods do not attached to any structue.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace